
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Отправлено Приход
	Движения.Отправлено.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ1 Из ТЧ1 Цикл
		Движение = Движения.Отправлено.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Издательтво = ТекСтрокаТЧ1.Издательство;
		Движение.Корреспонденция = ТекСтрокаТЧ1.Корреспонденция;
		Движение.количество = ТекСтрокаТЧ1.Количество;
	КонецЦикла;

	// регистр Остатки Расход
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ1 Из ТЧ1 Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Издательтво = ТекСтрокаТЧ1.Издательство;
		Движение.Корреспонденция = ТекСтрокаТЧ1.Корреспонденция;
		Движение.количество = ТекСтрокаТЧ1.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
