                                  
	                         &НаКлиенте
Процедура ТЧ1ЦенаДоставкиПриИзменении(Элемент)
	СТЧ=Элементы.ТЧ1.ТекущиеДанные;
	СТЧ.Стоимость = СТЧ.ЦенаДоставки + СТЧ.ЗаЦенность + СТЧ.ЦенаЗаВес;
КонецПроцедуры 
	                             &НаКлиенте
Процедура ТЧ1ЦенаЗаВесПриИзменении(Элемент)
	СТЧ=Элементы.ТЧ1.ТекущиеДанные;
	СТЧ.Стоимость = СТЧ.ЦенаДоставки + СТЧ.ЗаЦенность + СТЧ.ЦенаЗаВес;
КонецПроцедуры 
	  &НаКлиенте
Процедура ТЧ1ЗаЦенностьПриИзменении(Элемент)
	СТЧ=Элементы.ТЧ1.ТекущиеДанные;
	СТЧ.Стоимость = СТЧ.ЦенаДоставки + СТЧ.Ценность* 0.10 + СТЧ.ЦенаЗаВес;
КонецПроцедуры  
                 &НаКлиенте
        
             Процедура ТЧ1СпособДоставкиПриИзменении(Элемент)

                 СтрокаРасчета = Элементы.ТЧ1.ТекущиеДанные;
СтрокаРасчета.ЦенаДоставки = ПолучитьЦену1(СтрокаРасчета.СпособДоставки)
;   
            ТЧ1ЦенаДоставкиПриИзменении(Элемент);
           КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену1(НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Способ", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.СпособДоставки.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Стоимость;
	  КонецФункции    
	  
	  
	              &НаКлиенте

             Процедура ТЧ1ВесПриИзменении(Элемент)

                 СтрокаРасчета = Элементы.ТЧ1.ТекущиеДанные;
СтрокаРасчета.ЦенаЗаВес = ПолучитьЦену2(СтрокаРасчета.Вес);
               ТЧ1ЦенаЗаВесПриИзменении(Элемент);
КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену2(НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Вес", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.ВесПосылки.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Стоимость;     
		  
	  КонецФункции          

        &НаСервере
		функция ПолучитьЦену(НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.Ценность.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена; 
		  КонецФункции    